Revit 2027 API
VertexIndexPairArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	VertexIndexPair item,
	int index
)
Public Overridable Sub Insert (
	item As VertexIndexPair,
	index As Integer
)
public:
virtual void Insert(
	VertexIndexPair^ item,
	int index
)
abstract Insert :
        item : VertexIndexPair *
        index : int -> unit
override Insert :
        item : VertexIndexPair *
        index : int -> unit
Parameters
item VertexIndexPair
index Int32
See Also
Reference
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace